
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") 
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		Сумма = ДанныеЗаполнения.ИтогСумма;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Курс = РасчетыСервер.РасчетКурсаВалюты(Дата, Валюта);
	Если Курс = 0 Тогда
		Сообщить ("Курс валюты: " + Валюта + " на " + Дата + " не установлен.");
		Отказ = Истина;
	Иначе
		// регистр Хозрасчетный 
		Движения.Хозрасчетный.Записывать = Истина;
		Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.КассаОрганизации;
			Движение.Период = Дата;
			Движение.Сумма = Сумма;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор; 
		Иначе
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.КассаОрганизацииВал;
			Движение.Период = Дата;
			Движение.Сумма = Сумма * Курс; 
			Движение.ВалютаКт = Валюта;
			Движение.ВалютнаяСуммаКт = Сумма;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
		КонецЕсли; 
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
