
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") 
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		Договор = ДанныеЗаполнения.Договор;
		Сумма = ДанныеЗаполнения.ИтогСумма;
		Покупатель = ДанныеЗаполнения.Покупатель;
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли; 
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
  
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если  Валюта <> СчетПоступления.ВалютаСчета Тогда
		Сообщить ("Валюта счета - " + СчетПоступления.ВалютаСчета + " отличается от валюты документа - " + Валюта + ".");
		Отказ = Истина;
	Иначе
		Курс = РасчетыСервер.РасчетКурсаВалюты(Дата, Валюта);
		Если Курс = 0 Тогда
			Сообщить ("Курс валюты: " + Валюта + " на " + Дата + " не установлен.");
			Отказ = Истина;
		Иначе
			// регистр Хозрасчетный 
			Движения.Хозрасчетный.Записывать = Истина; 
			Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
				Движение.Период = Дата;
				Движение.Сумма = Сумма;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СчетаОрганизации] = СчетПоступления;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
			Иначе	
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
				Движение.Период = Дата;
				Движение.Сумма = Сумма * Курс; 
				Движение.ВалютаДт = Валюта;
				Движение.ВалютнаяСуммаДт = Сумма;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СчетаОрганизации] = СчетПоступления;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
