
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") 
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		Сумма = ДанныеЗаполнения.ИтогСумма;
		Получатель = ДанныеЗаполнения.Поставщик;
		Договор = ДанныеЗаполнения.Договор;
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли; 
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если  Валюта <> СчетСписания.ВалютаСчета Тогда
		Сообщить ("Валюта счета - " + СчетСписания.ВалютаСчета + " отличается от валюты документа - " + Валюта + ".");
		Отказ = Истина;
	Иначе
		Курс = РасчетыСервер.РасчетКурсаВалюты(Дата, Валюта);
		Если Курс = 0 Тогда
			Сообщить ("Курс валюты: " + Валюта + " на " + Дата + " не установлен.");
			Отказ = Истина;
		Иначе
			// регистр Хозрасчетный 
			Движения.Хозрасчетный.Записывать = Истина; 
			Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
				Движение.Период = Дата;
				Движение.Сумма = Сумма;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Получатель;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СчетаОрганизации] = СчетСписания;  
			Иначе
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
				Движение.СчетКт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
				Движение.Период = Дата;
				Движение.Сумма = Сумма * Курс;
				Движение.ВалютаКт = Валюта;
				Движение.ВалютнаяСуммаКт = Сумма;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Получатель;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СчетаОрганизации] = СчетСписания;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
