Функция РасчетКурсаВалюты(Дата, Валюта) Экспорт
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		Курс = 1;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
		
		Запрос.УстановитьПараметр("Валюта", Валюта);
		Запрос.УстановитьПараметр("Дата", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Курс = 0;
		Иначе
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			КурсВалюты = ВыборкаДетальныеЗаписи.Курс;
			Кратность =ВыборкаДетальныеЗаписи.Кратность;
			Курс = КурсВалюты / Кратность;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Курс;

КонецФункции 

Функция РасчетЦеныНоменклатурыВВалюте(Дата, Валюта, Номенклатура, ВидЦены) Экспорт
	
	Курс = РасчетыСервер.РасчетКурсаВалюты(Дата, Валюта);
	Если Курс = 0 Тогда
		ЦенаНоменклатурыВВалюте = 0;		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
		
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		Если РезультатЗапроса.Пустой() Тогда
			ЦенаНоменклатурыВВалюте = 0;
		Иначе
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			ЦенаНоменклатурыВВалюте = ВыборкаДетальныеЗаписи.Цена / Курс; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЦенаНоменклатурыВВалюте;	
	
  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции 