
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент) 
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество; 
    Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество; 
    Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент) 
    Элементы.Товары.ТекущиеДанные.Цена = РасчетыСервер.РасчетЦеныНоменклатурыВВалюте(Объект.Дата, Объект.Валюта,Элементы.Товары.ТекущиеДанные.Номенклатура, Объект.ВидЦены);
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;   
	Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Для  каждого Строка Из Объект.Товары  Цикл
	Строка.Цена = РасчетыСервер.РасчетЦеныНоменклатурыВВалюте(Объект.Дата, Объект.Валюта,Строка.Номенклатура, Объект.ВидЦены);
	Строка.Стоимость = Строка.Цена * Строка.Количество;
	КонецЦикла;
    Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	Для  каждого Строка Из Объект.Товары  Цикл
	Строка.Цена = РасчетыСервер.РасчетЦеныНоменклатурыВВалюте(Объект.Дата, Объект.Валюта,Строка.Номенклатура, Объект.ВидЦены);
	Строка.Стоимость = Строка.Цена * Строка.Количество;
	КонецЦикла;
    Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	 Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры
